#include <iostream>
#include <iomanip>

//Придумать несколько алгоритмов и сравнить их порядок сложности в лучшем, среднем и худшем случаях для решения слудующей задачи.
//Дан массив целых чисел a1, a2, ... , an, заполненный случайно. Необходимо переставить элементы массива так, чтобы вначале в массиве шла группа элементов, больших a1,
//затем сам этот элемент a1, потом группа элементов, меньших или равных ему.
//Комментарий: известно, что данную задачу можно решить таким способом, что число сравнений и перемещений, каждое в отдельности не будет превышать n-1

class Task
{
	int* arNumbers;
	int amountElement;
	public:
		Task(): amountElement(0) {};

};

int main()
{

	return 0;
}
